NFE/Open NFe Multiempresa/Open NFe Multiempresa/src/RDI.NFe2.Business/Web References/PNF.MS.Autorizacao/NfeAutorizacao.wsdl

<?xml version="1.0" encoding="utf-8"?>
<definitions xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:tns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeAutorizacao" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" name="NfeAutorizacao" targetNamespace="http://www.portalfiscal.inf.br/nfe/wsdl/NfeAutorizacao" xmlns="http://schemas.xmlsoap.org/wsdl/">
  <types>
    <xsd:schema>
      <xsd:import schemaLocation="https://nfe.fazenda.ms.gov.br:443/producao/services2/NfeAutorizacao?xsd=1" namespace="http://www.portalfiscal.inf.br/nfe/wsdl/NfeAutorizacao" />
    </xsd:schema>
  </types>
  <message name="nfeAutorizacaoLote">
    <part name="nfeDadosMsg" element="tns:nfeDadosMsg" />
    <part name="nfeCabecMsg" element="tns:nfeCabecMsg" />
  </message>
  <message name="nfeAutorizacaoLoteResponse">
    <part name="nfeAutorizacaoLoteResult" element="tns:nfeAutorizacaoLoteResult" />
    <part name="nfeCabecMsg" element="tns:nfeCabecMsg" />
  </message>
  <message name="nfeAutorizacaoLoteZip">
    <part name="nfeDadosMsgZip" element="tns:nfeDadosMsgZip" />
    <part name="nfeCabecMsg" element="tns:nfeCabecMsg" />
  </message>
  <message name="nfeAutorizacaoLoteZipResponse">
    <part name="nfeAutorizacaoLoteResult" element="tns:nfeAutorizacaoLoteResult" />
    <part name="nfeCabecMsg" element="tns:nfeCabecMsg" />
  </message>
  <portType name="NfeAutorizacaoSoap">
    <operation name="nfeAutorizacaoLote" parameterOrder="nfeDadosMsg nfeCabecMsg">
      <input wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NfeAutorizacao/nfeAutorizacaoLote" message="tns:nfeAutorizacaoLote" />
      <output wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NfeAutorizacao/NfeAutorizacaoSoap/nfeAutorizacaoLoteResponse" message="tns:nfeAutorizacaoLoteResponse" />
    </operation>
    <operation name="nfeAutorizacaoLoteZip" parameterOrder="nfeDadosMsgZip nfeCabecMsg">
      <input wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NfeAutorizacao/nfeAutorizacaoLoteZip" message="tns:nfeAutorizacaoLoteZip" />
      <output wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NfeAutorizacao/NfeAutorizacaoSoap/nfeAutorizacaoLoteZipResponse" message="tns:nfeAutorizacaoLoteZipResponse" />
    </operation>
  </portType>
  <binding name="nfeAutorizacaoSoap12Binding" type="tns:NfeAutorizacaoSoap">
    <soap12:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <operation name="nfeAutorizacaoLote">
      <soap12:operation soapAction="http://www.portalfiscal.inf.br/nfe/wsdl/NfeAutorizacao/nfeAutorizacaoLote" />
      <input>
        <soap12:body use="literal" parts="nfeDadosMsg" />
        <soap12:header message="tns:nfeAutorizacaoLote" part="nfeCabecMsg" use="literal" />
      </input>
      <output>
        <soap12:body use="literal" parts="nfeAutorizacaoLoteResult" />
        <soap12:header message="tns:nfeAutorizacaoLoteResponse" part="nfeCabecMsg" use="literal" />
      </output>
    </operation>
    <operation name="nfeAutorizacaoLoteZip">
      <soap12:operation soapAction="http://www.portalfiscal.inf.br/nfe/wsdl/NfeAutorizacao/nfeAutorizacaoLoteZip" />
      <input>
        <soap12:body use="literal" parts="nfeDadosMsgZip" />
        <soap12:header message="tns:nfeAutorizacaoLoteZip" part="nfeCabecMsg" use="literal" />
      </input>
      <output>
        <soap12:body use="literal" parts="nfeAutorizacaoLoteResult" />
        <soap12:header message="tns:nfeAutorizacaoLoteZipResponse" part="nfeCabecMsg" use="literal" />
      </output>
    </operation>
  </binding>
  <service name="NfeAutorizacao">
    <port name="nfeAutorizacaoSoap12" binding="tns:nfeAutorizacaoSoap12Binding">
      <soap12:address location="https://nfe.fazenda.ms.gov.br:443/producao/services2/NfeAutorizacao" />
    </port>
  </service>
</definitions>